bundles/binding/org.openhab.binding.wemo/src/main/java/org/openhab/binding/wemo/internal/SetRequest.xml

<?xml version="1.0" encoding="utf-8"?>
<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" s:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
  <s:Body>
    <u:SetBinaryState xmlns:u="urn:Belkin:service:basicevent:1">
      <BinaryState>{{state}}</BinaryState>
    </u:SetBinaryState>
  </s:Body>
</s:Envelope>