wemo_get_name.xml

<?xml version="1.0" encoding="utf-8"?>
<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"
        s:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
    <s:Body>
        <u:GetFriendlyName xmlns:u="urn:Belkin:service:basicevent:1">
        </u:GetFriendlyName>
    </s:Body>
</s:Envelope>
