devices/wemo/setstate.xml

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" s:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
	<s:Body>
		<u:SetBinaryState xmlns:u="urn:Belkin:service:basicevent:1">
			<BinaryState>%d</BinaryState>
		</u:SetBinaryState>
	</s:Body>
</s:Envelope>