info/wemo_sample_name

POST /upnp/control/basicevent1 HTTP/1.1
SOAPACTION: "urn:Belkin:service:basicevent:1#GetFriendlyName"
Content-Length: 290
Content-Type: text/xml; charset="utf-8"
HOST: 192.168.4.116:49152
User-Agent: CyberGarage-HTTP/1.0

<?xml version="1.0" encoding="utf-8"?>
<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" s:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
 <s:Body>
  <u:GetFriendlyName xmlns:u="urn:Belkin:service:basicevent:1">
   
  </u:GetFriendlyName>
 </s:Body>
</s:Envelope>








<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" s:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"><s:Body>
<u:GetFriendlyNameResponse xmlns:u="urn:Belkin:service:basicevent:1">
<FriendlyName>Fan</FriendlyName>
</u:GetFriendlyNameResponse>
</s:Body> </s:Envelope>