node_modules/wemonode/commands/all_getbinarystate.json

{
    "appliesTo": ["Socket","Sensor","Lightswitch"],
    "soapAction": "\"urn:Belkin:service:basicevent:1#GetBinaryState\"",
    "path": "/upnp/control/basicevent1",
    "envelope":"<?xml version=\"1.0\" encoding=\"utf-8\"?><s:Envelope xmlns:s=\"http://schemas.xmlsoap.org/soap/envelope/\" s:encodingStyle=\"http://schemas.xmlsoap.org/soap/encoding/\"><s:Body><u:GetBinaryState xmlns:u=\"urn:Belkin:service:basicevent:1\"></u:GetBinaryState></s:Body></s:Envelope>"
}
